In [156]:
import pandas as pd
# import matplotlib.pyplot as plt
# import os
# import seaborn as sns
# # from matplotlib import style
# plt.style.use('ggplot')
# % matplotlib inline

In [157]:
#This is the file path to my dataset. We have two datasets, train and test. We will use train dataset to train our model
#We will use test dataset to test our prediction on Kaggle
filepath = 'C:/Users/Umanga/Desktop/desktop 4/kaggle competitions/titanic dataset/train.csv'
filepath2 = 'C:/Users/Umanga/Desktop/desktop 4/kaggle competitions/titanic dataset/test.csv'
train = pd.read_csv(filepath)
test= pd.read_csv(filepath2)

In [158]:
# os.path.exists('C:/Users/Umanga/Desktop/desktop 4/kaggle competitions/titanic dataset/test.csv')

In [159]:
train.head()
# file2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [160]:
# file_target = ['Survived']
#we only need about 4 datasets to predict the survival rate.

In [161]:
#I am only using four datasets for my first submission because they are the datasets which most affect our results.
#Since women and children were allowed to board the lifeboat first followed by people who paid more money, they should be included
train_data = ['Age', 'Pclass', 'Sex', 'Fare']

In [162]:
#Our target variable is survived
train_target = ['Survived']

In [163]:
x = train[train_data]
y = train[train_target]
# x.head()

In [164]:
#we check if the data has null values
#I know that Age has null values so I am doing it on a different line
x['Pclass'].isnull().sum()
x['Sex'].isnull().sum()
x['Fare'].isnull().sum()
x.head()

    Age  Pclass     Sex     Fare
0  22.0       3    male   7.2500
1  38.0       1  female  71.2833
2  26.0       3  female   7.9250
3  35.0       1  female  53.1000
4  35.0       3    male   8.0500

In [165]:
#Age has null values
x['Age'].isnull().sum()

177

In [166]:
#we use the .fillna function to fill all the empty values with median of the whole data.
x['Age']=x['Age'].fillna(x['Age'].median())
x['Age'].isnull().sum()

C:\Users\Umanga\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

0

In [167]:
#we convert male and female values to integers.
dict = {'male':0, 'female':1}
x['Sex'] = x['Sex'].apply(lambda x:dict[x])

C:\Users\Umanga\Anaconda3\lib\site-packages\ipykernel\__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app

In [168]:
x.head()
# x2.head()

    Age  Pclass  Sex     Fare
0  22.0       3    0   7.2500
1  38.0       1    1  71.2833
2  26.0       3    1   7.9250
3  35.0       1    1  53.1000
4  35.0       3    0   8.0500

In [169]:
#I am using Logistic Regression because it is the simplest model to use for classification problems.
from sklearn.linear_model import LogisticRegression
logReg = LogisticRegression()
logReg.fit(x, y)

C:\Users\Umanga\Anaconda3\lib\site-packages\sklearn\utils\validation.py:515: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [170]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [171]:
test_data = ['Age', 'Pclass', 'Sex', 'Fare']

In [172]:
x2 = test[test_data]

In [173]:
x2.head()

    Age  Pclass     Sex     Fare
0  34.5       3    male   7.8292
1  47.0       3  female   7.0000
2  62.0       2    male   9.6875
3  27.0       3    male   8.6625
4  22.0       3  female  12.2875

In [174]:
#Age had some null values so I put the median values instead. I should have probably used the median of the whole dataset combined
#Rather I used the train dataset. I will do that in second submission when I have time.
x2['Age']=x2['Age'].fillna(x2['Age'].median())
x2['Age'].isnull().sum()

C:\Users\Umanga\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

0

In [175]:
#Upon checking Fare also had some none values, so I put the median fair value.
x2['Fare']=x2['Fare'].fillna(x2['Fare'].median())
x2['Fare'].isnull().sum()

C:\Users\Umanga\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

0

In [176]:
#we convert male and female to integer values
dict2 = {'male':0, 'female':1}
x2['Sex'] = x2['Sex'].apply(lambda x2:dict2[x2])

C:\Users\Umanga\Anaconda3\lib\site-packages\ipykernel\__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app

In [177]:
x2_survived = logReg.predict(x2)

In [178]:
x2_survived

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0,
       1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0,
       1, 0, 0, 0], dtype=int64)

In [182]:
#We put the dataframe in a csv file to submit. :)
pd.DataFrame({'PassengerId': test.PassengerId, 'Survived':x2_survived}).to_csv('Titanic_predict.csv')